; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l6_p6_c6_g6_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(crate-content crate1 food)
	(crate-content crate2 medicine)
	(crate-content crate3 medicine)
	(crate-content crate4 medicine)
	(crate-content crate5 medicine)
	(crate-content crate6 medicine)
	(at person1 loc3)
	(at person2 loc5)
	(at person3 loc6)
	(at person4 loc5)
	(at person5 loc2)
	(at person6 loc1)
	(person-needs person1 medicine)
	(person-needs person2 food)
	(person-needs person2 medicine)
	(person-needs person3 medicine)
	(person-needs person4 medicine)
	(person-needs person6 medicine)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 medicine)
	(person-has person2 food)
	(person-has person2 medicine)
	(person-has person3 medicine)
	(person-has person4 medicine)
	(person-has person6 medicine)
	))
)

; plan
1. (grab-arm1 drone1 crate1 depot)
   deleted: (arm1-free drone1) (at crate1 depot)
   added: (arm1-load drone1 crate1)
   goals met: 1 of 7
2. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 0 of 7
3. (deliver-arm1 drone1 person2 crate1 food loc5)
   deleted: (arm1-load drone1 crate1) (person-needs person2 food)
   added: (arm1-free drone1) (person-has person2 food)
   goals met: 1 of 7
4. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 2 of 7
5. (grab-arm1 drone1 crate4 depot)
   deleted: (arm1-free drone1) (at crate4 depot)
   added: (arm1-load drone1 crate4)
   goals met: 2 of 7
6. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 1 of 7
7. (deliver-arm1 drone1 person1 crate4 medicine loc3)
   deleted: (arm1-load drone1 crate4) (person-needs person1 medicine)
   added: (arm1-free drone1) (person-has person1 medicine)
   goals met: 2 of 7
8. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 3 of 7
9. (grab-arm1 drone1 crate2 depot)
   deleted: (arm1-free drone1) (at crate2 depot)
   added: (arm1-load drone1 crate2)
   goals met: 3 of 7
10. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 2 of 7
11. (deliver-arm1 drone1 person2 crate2 medicine loc5)
   deleted: (arm1-load drone1 crate2) (person-needs person2 medicine)
   added: (arm1-free drone1) (person-has person2 medicine)
   goals met: 3 of 7
12. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 4 of 7
13. (grab-arm1 drone1 crate5 depot)
   deleted: (arm1-free drone1) (at crate5 depot)
   added: (arm1-load drone1 crate5)
   goals met: 4 of 7
14. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 3 of 7
15. (deliver-arm1 drone1 person3 crate5 medicine loc6)
   deleted: (arm1-load drone1 crate5) (person-needs person3 medicine)
   added: (arm1-free drone1) (person-has person3 medicine)
   goals met: 4 of 7
16. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 5 of 7
17. (grab-arm1 drone1 crate3 depot)
   deleted: (arm1-free drone1) (at crate3 depot)
   added: (arm1-load drone1 crate3)
   goals met: 5 of 7
18. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 4 of 7
19. (deliver-arm1 drone1 person4 crate3 medicine loc5)
   deleted: (arm1-load drone1 crate3) (person-needs person4 medicine)
   added: (arm1-free drone1) (person-has person4 medicine)
   goals met: 5 of 7
20. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 6 of 7
21. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 6 of 7
22. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 5 of 7
23. (deliver-arm1 drone1 person6 crate6 medicine loc1)
   deleted: (arm1-load drone1 crate6) (person-needs person6 medicine)
   added: (arm1-free drone1) (person-has person6 medicine)
   goals met: 6 of 7
24. (move-drone drone1 loc1 depot)
   deleted: (at drone1 loc1)
   added: (at drone1 depot)
   goals met: 7 of 7
